src/InformationRegisters/ПРО_ПереопределяемыеПравилаРегистрацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПРО_ПереопределяемыеПравилаРегистрацииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияОбъектаРазрешена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПОД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименитьСобственноеПравило</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсполняемыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПРО_УзелПланаОбмена</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРегистрации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПРО_ИдентификаторОбъектаМетаданных</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ПРО_ПереопределяемыеПравилаРегистрацииОбъектов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПРО_УправлениеПравиламиРегистрацииСлужебный.СброситьКэшПравилРегистрации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрименитьСобственноеПравилоПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьПравило(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеРедактораКонсолиКода", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПРО_ИсходныйИсполняемыйКод", Запись.ИсполняемыйКод);
	ПараметрыФормы.Вставить("ПРО_ОбъектРегистрации", Запись.ОбъектРегистрации);
	
	ОткрытьФорму("Обработка.ПРО_УправлениеРегистрациейДанныхКонсольКода.Форма", 
		ПараметрыФормы, 
		ЭтотОбъект, 
		УникальныйИдентификатор, , ,
		Оповещение, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Элементы.НастроитьПравило.Видимость = Запись.ПрименитьСобственноеПравило;
	
	УстановитьЗаголовокНастройкиПравил();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокНастройкиПравил()
	
	Если Запись.ПрименитьСобственноеПравило И Не ЗначениеЗаполнено(Запись.ИсполняемыйКод) Тогда
		Элементы.НастроитьПравило.Заголовок = "<правило не заполнено, заполнить>";
		Элементы.НастроитьПравило.ЦветТекста = ЦветаСтиля.ЦветТекстаПроблема;
	Иначе
		Элементы.НастроитьПравило.Заголовок = "Настроить правило";
		Элементы.НастроитьПравило.ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактораКонсолиКода(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Если Результат.Модифицирован Тогда
			Запись.ИсполняемыйКод = Результат.ВыполняемыйКод;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьЗаголовокНастройкиПравил();
	
КонецПроцедуры

#КонецОбласти
